export const menu = (pushname) => {

        return `
╔═══〔 👨‍💻 REAL HACKER BOT 〕═══╗
┃ 👤 USER : ${pushname}
┃ 🤖 BOT  : REAL HACKER
┃ 👑 OWNER: RUZZER B47
┃ ⚡ PREFIX: .
╚═══════════════════════╝

┏━━━〔 📜 MAIN MENU 〕━━━┓
┃ .menu
┃ .ping
┃ .runtime
┗━━━━━━━━━━━━━━━┛

┏━━━〔 🛡 ETHICAL HACKING 〕━━━┓
┃ .portscan
┃ .whois
┃ .iplookup
┃ .dnslookup
┃ .headers
┃ .hash
┃ .base64
┃ .passwordgen
┗━━━━━━━━━━━━━━━┛

┏━━━〔 🔐 CYBER SECURITY 〕━━━┓
┃ .encrypt
┃ .decrypt
┃ .hashidentify
┃ .phishingdetect
┃ .passwordcheck
┃ .securitytips
┗━━━━━━━━━━━━━━━┛

┏━━━〔 ⚙️ TOOLS MENU 〕━━━┓
┃ .tts
┃ .translate
┃ .calculator
┃ .weather
┃ .shortlink╝
┃ .qr
┗━━━━━━━━━━━━━━━┛

┏━━━〔 👥 GROUP MENU 〕━━━┓
┃ .linkgroup
┃ .kick
┃ .add
┃ .promote
┃ .demote
┃ .tagall
┃ .hidetag
┗━━━━━━━━━━━━━━━┛

┏━━━〔 🤖 AI MENU 〕━━━┓
┃ .ai
┃ .chatgpt
┃ .imagine
┃ .ask
┗━━━━━━━━━━━━━━━┛

┏━━━〔 🎭 FUN MENU 〕━━━┓
┃ .joke
┃ .meme
┃ .quote
┃ .truth
┃ .dare
┗━━━━━━━━━━━━━━━┛

┏━━━〔 👑 OWNER MENU 〕━━━┓
┃ .restart
┃ .shutdown
┃ .block
┃ .unblock
┃ .broadcast
┗━━━━━━━━━━━━━━━┛

╔═══════════════════════╗
║ ⚡ REAL HACKER SYSTEM
║ 🔥 BY RUZZER B47
╚═══════════════════════
`
}
